#==================================================================
# DATE: 2025-09-17
# AUTHOR: CiMorn
#==================================================================


#==================================================================
# 方法一：判断有没有0，有0则返回0，没有0则判断负数个数，负数个数为偶数返回1，为奇数返回-1
#==================================================================
class Solution(object):
    def arraySign(self, nums):
        product=1
        for num in nums:
            if num==0:
                return 0
            elif num<0:
                product*=-1
        return product

        


if __name__ == "__main__":
    # 用列表存储所有测试用例
    test_cases = [
        ([-1,-2,-3,-4,3,2,1]),
        ([1,5,0,2,-3]),
        ([-1,1,-1,1,-1])
    ]
    
    print("-" * 50)  # 分隔线
    # 循环遍历测试用例并执行
    for test_x in test_cases:
        print(f"输入: '{test_x}'")
        result = Solution().arraySign(test_x)
        # 打印测试结果（包含输入、实际输出和预期输出）
        print(f"输出: '{result}'")
        print("-" * 50)  # 分隔线